

https://inf-ege.sdamgia.ru/problem?id=37144
Электронная таблица содержит результаты метеорологических наблюдений. Найдите разницу между максимальной температурой в июле и минимальной температурой в октябре. В ответе запишите только целую часть полученного результата.

Такую задачу нет смысла решать программированием...


https://inf-ege.sdamgia.ru/problem?id=38588
Выясните, какое количество троек чисел может являться сторонами треугольника, то есть удовлетворяет неравенству треугольника. В ответе запишите только число.


https://inf-ege.sdamgia.ru/problem?id=39238
Определите, сколько среди заданных троек чисел таких, которые могут быть сторонами прямоугольного треугольника.


https://inf-ege.sdamgia.ru/problem?id=38943
Определите сколько среди заданных троек чисел таких, которые могут быть сторонами остроугольного треугольника.


https://kompege.ru/task
2034
Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел могут являться величинами углов треугольника, выраженных в градусах. В ответе запишите только число.

2035
Откройте файл электронной таблицы, содержащей в каждой строке три натуральных числа. Выясните, какое количество троек чисел НЕ могут являться величинами углов треугольника, выраженных в градусах. В ответе запишите только число.

https://inf-ege.sdamgia.ru/problem?id=47213
Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:
a — в строке только одно число повторяется ровно два раза, остальные числа различны;
b — среднее арифметическое неповторяющихся чисел строки не больше суммы повторяющихся чисел.
В ответе запишите только число.

str() # 'hello'
bool() # False
int() # 10
float() # 1.4
lst = list() # [1,2,1,4,3,7]
st = set(lst) # {1,2,3,4,7}

##cnt = 0
##for line in open('09_47213.txt'):
##    lst = [int(e) for e in line.split(';')]
##    if True: cnt += 1
##print(cnt)

# [68, 57, 7, 15, 34, 19]


