
**task14**  

---  

ещё один вариант решшения задачи - https://inf-ege.sdamgia.ru/problem?id=7761
Сколько единиц содержится в двоичной записи  
значения выражения: 4**2020 + 2**2017 – 15?  
Ответ: 2015
Сделать без проверки if, а сразу прибавлять:  

```py
x = 4**2020 + 2**2017 - 15
cnt = 0
while x > 0:
    if x % 2:  # 0 -> False; осталь -> True
        cnt += 1
    x //= 2  # x = x // 2
print(cnt)
```

---  

- решить demo 14 с помощью int  
- написать свой int(s, 15)  
- использовать конкатенацию строк или f"{}"  

---  

**task17**  

---  
