def f(x,y,z,w):  # (z ≡ ¬x) → ((w → ¬y) ∧ (y → x))
    return (z == (1-x)) <= ((w<=(1-y)) and (y<=x))


for x in 0,1:
    for y in 0,1:
        for z in 0,1:
            for w in 0,1:
                # if not(f(x,y,z,w)):
                if f(x,y,z,w):                  
                    print(x,y,z,w)

"""
сначала ищем все строки для f==0
1 1 0 1 - - так как ни с кем не даст 3 0
1 1 0 0
1 0 1 1
y z
потом все для f==1 и убираем лишние
1 1 1 0

или наоборот - f==1:
1 0 1 1
1 1 1 0
_ _ _ y
_ _ _ w

"""