# https://inf-ege.sdamgia.ru/problem?id=27385

x = 343**5 + 343**4 + 49**6 - 7**13 - 21
#     [0,1,2,3,4,5,6]
# lst = [0,0,0,0,0,0,0]

# x = 12
result = ''
while x > 0:
    ost = x % 7
    result = str(ost) + result
    x = x // 7
print(result)
# [1, 1, 0, 0, 1, 0, 12]
# 661666666666640

'''
Значение выражения
343**5 + 343**4 + 49**6 − 7**13 − 21
записали в системе счисления с основанием 7.
Сколько различных цифр содержит эта запись?
'''
