''' Задача 15 ЕГЭ - 2022
На числовой прямой даны два отрезка: 
    P = [5, 30] и Q = [14, 23]. 
Укажите наибольшую возможную длину промежутка A, 
для которого формула
    ((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)
истинна при любом значении переменной х.'''
d = 0
a = 4
while a < 31:
    a += .2
    b = a + .2
    while b < 31:
        b += .2
        x = 4
        while x < 31:
            x += .2

            f1 = ((5<=x<=30) == (14<=x<=23))
            f2 = not(a<=x<=b)
            f = f1 <= f2
            if not f:
                break
        else:
            d = max(d, b-a)
print(round(d,2))