# https://inf-ege.sdamgia.ru/problem?id=7761

print(bin(4**2020 + 2**2017 - 15).count('1'))

'''
Сколько единиц содержится в двоичной записи 
значения выражения: 4**2020 + 2**2017 – 15?
2015
'''