# https://inf-ege.sdamgia.ru/problem?id=7761

x = 4**2020 + 2**2017 - 15
b = bin(x)[2:]
c = b.count('1')
print(c)

# Сколько единиц содержится в двоичной записи значения выражения: 
#     4**2020 + 2**2017 - 15
